MikroElektronika/core_packages/PIC/XC8/def/PIC18F65K90/mcu.h
#define                                 RE5_bit             _BIT_ACCESS(PORTE,5)
// PORTE<RE6>
extern volatile __bit                   RE6                 __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 RE6_bit             _BIT_ACCESS(PORTE,6)
// PORTE<RE7>
extern volatile __bit                   RE7                 __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 RE7_bit             _BIT_ACCESS(PORTE,7)
// SSP2STAT<READ_WRITE2>
extern volatile __bit                   READ_WRITE2         __at(0x7802);	// @ (0xF00 * 8 + 2)
#define                                 READ_WRITE2_bit     _BIT_ACCESS(SSP2STAT,2)
// PORTE<REFO>
extern volatile __bit                   REFO                __at(0x7C24);	// @ (0xF84 * 8 + 4)
#define                                 REFO_bit            _BIT_ACCESS(PORTE,4)
// WDTCON<REGSLP>
extern volatile __bit                   REGSLP              __at(0x7E8F);	// @ (0xFD1 * 8 + 7)
#define                                 REGSLP_bit          _BIT_ACCESS(WDTCON,7)
// PADCFG1<REPU>
extern volatile __bit                   REPU                __at(0x7A9E);	// @ (0xF53 * 8 + 6)
#define                                 REPU_bit            _BIT_ACCESS(PADCFG1,6)
// PORTF<RF1>
extern volatile __bit                   RF1                 __at(0x7C29);	// @ (0xF85 * 8 + 1)
#define                                 RF1_bit             _BIT_ACCESS(PORTF,1)
// PORTF<RF2>
extern volatile __bit                   RF2                 __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 RF2_bit             _BIT_ACCESS(PORTF,2)
// PORTF<RF3>
extern volatile __bit                   RF3                 __at(0x7C2B);	// @ (0xF85 * 8 + 3)
#define                                 RF3_bit             _BIT_ACCESS(PORTF,3)
// PORTF<RF4>
extern volatile __bit                   RF4                 __at(0x7C2C);	// @ (0xF85 * 8 + 4)
#define                                 RF4_bit             _BIT_ACCESS(PORTF,4)
// PORTF<RF5>
extern volatile __bit                   RF5                 __at(0x7C2D);	// @ (0xF85 * 8 + 5)
#define                                 RF5_bit             _BIT_ACCESS(PORTF,5)
// PORTF<RF6>
extern volatile __bit                   RF6                 __at(0x7C2E);	// @ (0xF85 * 8 + 6)
#define                                 RF6_bit             _BIT_ACCESS(PORTF,6)
// PORTF<RF7>
extern volatile __bit                   RF7                 __at(0x7C2F);	// @ (0xF85 * 8 + 7)
#define                                 RF7_bit             _BIT_ACCESS(PORTF,7)
// PORTG<RG0>
extern volatile __bit                   RG0                 __at(0x7C30);	// @ (0xF86 * 8 + 0)
#define                                 RG0_bit             _BIT_ACCESS(PORTG,0)
// PORTG<RG1>
extern volatile __bit                   RG1                 __at(0x7C31);	// @ (0xF86 * 8 + 1)
#define                                 RG1_bit             _BIT_ACCESS(PORTG,1)
// PORTG<RG2>
extern volatile __bit                   RG2                 __at(0x7C32);	// @ (0xF86 * 8 + 2)
#define                                 RG2_bit             _BIT_ACCESS(PORTG,2)
// PORTG<RG3>
extern volatile __bit                   RG3                 __at(0x7C33);	// @ (0xF86 * 8 + 3)
#define                                 RG3_bit             _BIT_ACCESS(PORTG,3)
// PORTG<RG4>
extern volatile __bit                   RG4                 __at(0x7C34);	// @ (0xF86 * 8 + 4)
#define                                 RG4_bit             _BIT_ACCESS(PORTG,4)
// PORTG<RG5>
extern volatile __bit                   RG5                 __at(0x7C35);	// @ (0xF86 * 8 + 5)
#define                                 RG5_bit             _BIT_ACCESS(PORTG,5)
// RCON<RI>
extern volatile __bit                   RI                  __at(0x7E84);	// @ (0xFD0 * 8 + 4)
#define                                 RI_bit              _BIT_ACCESS(RCON,4)
// REFOCON<RODIV0>
extern volatile __bit                   RODIV0              __at(0x7950);	// @ (0xF2A * 8 + 0)
#define                                 RODIV0_bit          _BIT_ACCESS(REFOCON,0)
// REFOCON<RODIV1>
extern volatile __bit                   RODIV1              __at(0x7951);	// @ (0xF2A * 8 + 1)
#define                                 RODIV1_bit          _BIT_ACCESS(REFOCON,1)
// REFOCON<RODIV2>
extern volatile __bit                   RODIV2              __at(0x7952);	// @ (0xF2A * 8 + 2)
#define                                 RODIV2_bit          _BIT_ACCESS(REFOCON,2)
// REFOCON<RODIV3>
extern volatile __bit                   RODIV3              __at(0x7953);	// @ (0xF2A * 8 + 3)
#define                                 RODIV3_bit          _BIT_ACCESS(REFOCON,3)
// REFOCON<ROON>
extern volatile __bit                   ROON                __at(0x7957);	// @ (0xF2A * 8 + 7)
#define                                 ROON_bit            _BIT_ACCESS(REFOCON,7)
// REFOCON<ROSEL>
extern volatile __bit                   ROSEL               __at(0x7954);	// @ (0xF2A * 8 + 4)
#define                                 ROSEL_bit           _BIT_ACCESS(REFOCON,4)
// REFOCON<ROSSLP>
extern volatile __bit                   ROSSLP              __at(0x7955);	// @ (0xF2A * 8 + 5)
#define                                 ROSSLP_bit          _BIT_ACCESS(REFOCON,5)
// SSP1CON2<RSEN1>
extern volatile __bit                   RSEN1               __at(0x7E29);	// @ (0xFC5 * 8 + 1)
#define                                 RSEN1_bit           _BIT_ACCESS(SSP1CON2,1)
// SSP2CON2<RSEN2>
extern volatile __bit                   RSEN2               __at(0x77F1);	// @ (0xEFE * 8 + 1)
#define                                 RSEN2_bit           _BIT_ACCESS(SSP2CON2,1)
// PORTG<RTCC>
extern volatile __bit                   RTCC                __at(0x7C34);	// @ (0xF86 * 8 + 4)
#define                                 RTCC_bit            _BIT_ACCESS(PORTG,4)
// PIE3<RTCCIE>
extern volatile __bit                   RTCCIE              __at(0x7D18);	// @ (0xFA3 * 8 + 0)
#define                                 RTCCIE_bit          _BIT_ACCESS(PIE3,0)
// PIR3<RTCCIF>
extern volatile __bit                   RTCCIF              __at(0x7D20);	// @ (0xFA4 * 8 + 0)
#define                                 RTCCIF_bit          _BIT_ACCESS(PIR3,0)
// IPR3<RTCCIP>
extern volatile __bit                   RTCCIP              __at(0x7D28);	// @ (0xFA5 * 8 + 0)
#define                                 RTCCIP_bit          _BIT_ACCESS(IPR3,0)
// PMD1<RTCCMD>
extern volatile __bit                   RTCCMD              __at(0x78C5);	// @ (0xF18 * 8 + 5)
#define                                 RTCCMD_bit          _BIT_ACCESS(PMD1,5)
// RTCCFG<RTCEN>
extern volatile __bit                   RTCEN               __at(0x7AFF);	// @ (0xF5F * 8 + 7)
#define                                 RTCEN_bit           _BIT_ACCESS(RTCCFG,7)
// RTCCFG<RTCOE>
extern volatile __bit                   RTCOE               __at(0x7AFA);	// @ (0xF5F * 8 + 2)
#define                                 RTCOE_bit           _BIT_ACCESS(RTCCFG,2)
// RTCCFG<RTCPTR0>
extern volatile __bit                   RTCPTR0             __at(0x7AF8);	// @ (0xF5F * 8 + 0)
#define                                 RTCPTR0_bit         _BIT_ACCESS(RTCCFG,0)
// RTCCFG<RTCPTR1>
extern volatile __bit                   RTCPTR1             __at(0x7AF9);	// @ (0xF5F * 8 + 1)
#define                                 RTCPTR1_bit         _BIT_ACCESS(RTCCFG,1)
// RTCCFG<RTCSYNC>
extern volatile __bit                   RTCSYNC             __at(0x7AFC);	// @ (0xF5F * 8 + 4)
#define                                 RTCSYNC_bit         _BIT_ACCESS(RTCCFG,4)
// RTCCFG<RTCWREN>
extern volatile __bit                   RTCWREN             __at(0x7AFD);	// @ (0xF5F * 8 + 5)
#define                                 RTCWREN_bit         _BIT_ACCESS(RTCCFG,5)
// PADCFG1<RTSECSEL0>
extern volatile __bit                   RTSECSEL0           __at(0x7A99);	// @ (0xF53 * 8 + 1)
#define                                 RTSECSEL0_bit       _BIT_ACCESS(PADCFG1,1)
// PADCFG1<RTSECSEL1>
extern volatile __bit                   RTSECSEL1           __at(0x7A9A);	// @ (0xF53 * 8 + 2)
#define                                 RTSECSEL1_bit       _BIT_ACCESS(PADCFG1,2)
// SSP1STAT<RW>
extern volatile __bit                   RW                  __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 RW_bit              _BIT_ACCESS(SSP1STAT,2)
// SSP1STAT<RW1>
extern volatile __bit                   RW1                 __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 RW1_bit             _BIT_ACCESS(SSP1STAT,2)
// SSP2STAT<RW2>
extern volatile __bit                   RW2                 __at(0x7802);	// @ (0xF00 * 8 + 2)
#define                                 RW2_bit             _BIT_ACCESS(SSP2STAT,2)
// PORTC<RX1>
extern volatile __bit                   RX1                 __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 RX1_bit             _BIT_ACCESS(PORTC,7)
// PORTG<RX2>
extern volatile __bit                   RX2                 __at(0x7C32);	// @ (0xF86 * 8 + 2)
#define                                 RX2_bit             _BIT_ACCESS(PORTG,2)
// RCSTA1<RX91>
extern volatile __bit                   RX91                __at(0x7D5E);	// @ (0xFAB * 8 + 6)
#define                                 RX91_bit            _BIT_ACCESS(RCSTA1,6)
// RCSTA2<RX92>
extern volatile __bit                   RX92                __at(0x7916);	// @ (0xF22 * 8 + 6)
#define                                 RX92_bit            _BIT_ACCESS(RCSTA2,6)
// RCSTA1<RX9D1>
extern volatile __bit                   RX9D1               __at(0x7D58);	// @ (0xFAB * 8 + 0)
#define                                 RX9D1_bit           _BIT_ACCESS(RCSTA1,0)
// RCSTA2<RX9D2>
extern volatile __bit                   RX9D2               __at(0x7910);	// @ (0xF22 * 8 + 0)
#define                                 RX9D2_bit           _BIT_ACCESS(RCSTA2,0)
// PIE3<RXB0IE>
extern volatile __bit                   RXB0IE              __at(0x7D18);	// @ (0xFA3 * 8 + 0)
#define                                 RXB0IE_bit          _BIT_ACCESS(PIE3,0)
// PIE3<RXB1IE>
extern volatile __bit                   RXB1IE              __at(0x7D19);	// @ (0xFA3 * 8 + 1)
#define                                 RXB1IE_bit          _BIT_ACCESS(PIE3,1)
// PIE3<RXBNIE>
extern volatile __bit                   RXBNIE              __at(0x7D19);	// @ (0xFA3 * 8 + 1)
#define                                 RXBNIE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<RXBNIF>
extern volatile __bit                   RXBNIF              __at(0x7D21);	// @ (0xFA4 * 8 + 1)
#define                                 RXBNIF_bit          _BIT_ACCESS(PIR3,1)
// IPR3<RXBNIP>
extern volatile __bit                   RXBNIP              __at(0x7D29);	// @ (0xFA5 * 8 + 1)
#define                                 RXBNIP_bit          _BIT_ACCESS(IPR3,1)
// BAUDCON1<RXCKP>
extern volatile __bit                   RXCKP               __at(0x7B2D);	// @ (0xF65 * 8 + 5)
#define                                 RXCKP_bit           _BIT_ACCESS(BAUDCON1,5)
// BAUDCON1<RXDTP1>
extern volatile __bit                   RXDTP1              __at(0x7B2D);	// @ (0xF65 * 8 + 5)
#define                                 RXDTP1_bit          _BIT_ACCESS(BAUDCON1,5)
// BAUDCON2<RXDTP2>
extern volatile __bit                   RXDTP2              __at(0x7905);	// @ (0xF20 * 8 + 5)
#define                                 RXDTP2_bit          _BIT_ACCESS(BAUDCON2,5)
// SSP2STAT<R_NOT_W2>
extern volatile __bit                   R_NOT_W2            __at(0x7802);	// @ (0xF00 * 8 + 2)
#define                                 R_NOT_W2_bit        _BIT_ACCESS(SSP2STAT,2)
// SSP2STAT<R_W2>
extern volatile __bit                   R_W2                __at(0x7802);	// @ (0xF00 * 8 + 2)
#define                                 R_W2_bit            _BIT_ACCESS(SSP2STAT,2)
// SSP2STAT<R_nW2>
extern volatile __bit                   R_nW2               __at(0x7802);	// @ (0xF00 * 8 + 2)
#define                                 R_nW2_bit           _BIT_ACCESS(SSP2STAT,2)
// LCDDATA0<S00C0>
extern volatile __bit                   S00C0               __at(0x7B30);	// @ (0xF66 * 8 + 0)
#define                                 S00C0_bit           _BIT_ACCESS(LCDDATA0,0)
// LCDDATA6<S00C1>
extern volatile __bit                   S00C1               __at(0x7B60);	// @ (0xF6C * 8 + 0)
#define                                 S00C1_bit           _BIT_ACCESS(LCDDATA6,0)
// LCDDATA12<S00C2>
extern volatile __bit                   S00C2               __at(0x7B90);	// @ (0xF72 * 8 + 0)
#define                                 S00C2_bit           _BIT_ACCESS(LCDDATA12,0)
// LCDDATA18<S00C3>
extern volatile __bit                   S00C3               __at(0x7BC0);	// @ (0xF78 * 8 + 0)
#define                                 S00C3_bit           _BIT_ACCESS(LCDDATA18,0)
// LCDDATA0<S01C0>
extern volatile __bit                   S01C0               __at(0x7B31);	// @ (0xF66 * 8 + 1)
#define                                 S01C0_bit           _BIT_ACCESS(LCDDATA0,1)
// LCDDATA6<S01C1>
extern volatile __bit                   S01C1               __at(0x7B61);	// @ (0xF6C * 8 + 1)
#define                                 S01C1_bit           _BIT_ACCESS(LCDDATA6,1)
// LCDDATA12<S01C2>
extern volatile __bit                   S01C2               __at(0x7B91);	// @ (0xF72 * 8 + 1)
#define                                 S01C2_bit           _BIT_ACCESS(LCDDATA12,1)
// LCDDATA18<S01C3>
extern volatile __bit                   S01C3               __at(0x7BC1);	// @ (0xF78 * 8 + 1)
#define                                 S01C3_bit           _BIT_ACCESS(LCDDATA18,1)
// LCDDATA0<S02C0>
extern volatile __bit                   S02C0               __at(0x7B32);	// @ (0xF66 * 8 + 2)
#define                                 S02C0_bit           _BIT_ACCESS(LCDDATA0,2)
// LCDDATA6<S02C1>
extern volatile __bit                   S02C1               __at(0x7B62);	// @ (0xF6C * 8 + 2)
#define                                 S02C1_bit           _BIT_ACCESS(LCDDATA6,2)
// LCDDATA12<S02C2>
extern volatile __bit                   S02C2               __at(0x7B92);	// @ (0xF72 * 8 + 2)
#define                                 S02C2_bit           _BIT_ACCESS(LCDDATA12,2)
// LCDDATA18<S02C3>
extern volatile __bit                   S02C3               __at(0x7BC2);	// @ (0xF78 * 8 + 2)
#define                                 S02C3_bit           _BIT_ACCESS(LCDDATA18,2)
// LCDDATA0<S03C0>
extern volatile __bit                   S03C0               __at(0x7B33);	// @ (0xF66 * 8 + 3)
#define                                 S03C0_bit           _BIT_ACCESS(LCDDATA0,3)
// LCDDATA6<S03C1>
extern volatile __bit                   S03C1               __at(0x7B63);	// @ (0xF6C * 8 + 3)
#define                                 S03C1_bit           _BIT_ACCESS(LCDDATA6,3)
// LCDDATA12<S03C2>
extern volatile __bit                   S03C2               __at(0x7B93);	// @ (0xF72 * 8 + 3)
#define                                 S03C2_bit           _BIT_ACCESS(LCDDATA12,3)
// LCDDATA18<S03C3>
extern volatile __bit                   S03C3               __at(0x7BC3);	// @ (0xF78 * 8 + 3)
#define                                 S03C3_bit           _BIT_ACCESS(LCDDATA18,3)
// LCDDATA0<S04C0>
extern volatile __bit                   S04C0               __at(0x7B34);	// @ (0xF66 * 8 + 4)
#define                                 S04C0_bit           _BIT_ACCESS(LCDDATA0,4)
// LCDDATA6<S04C1>
extern volatile __bit                   S04C1               __at(0x7B64);	// @ (0xF6C * 8 + 4)
#define                                 S04C1_bit           _BIT_ACCESS(LCDDATA6,4)
// LCDDATA12<S04C2>
extern volatile __bit                   S04C2               __at(0x7B94);	// @ (0xF72 * 8 + 4)
#define                                 S04C2_bit           _BIT_ACCESS(LCDDATA12,4)
// LCDDATA18<S04C3>
extern volatile __bit                   S04C3               __at(0x7BC4);	// @ (0xF78 * 8 + 4)
#define                                 S04C3_bit           _BIT_ACCESS(LCDDATA18,4)
// LCDDATA0<S05C0>
extern volatile __bit                   S05C0               __at(0x7B35);	// @ (0xF66 * 8 + 5)
#define                                 S05C0_bit           _BIT_ACCESS(LCDDATA0,5)
// LCDDATA6<S05C1>
extern volatile __bit                   S05C1               __at(0x7B65);	// @ (0xF6C * 8 + 5)
#define                                 S05C1_bit           _BIT_ACCESS(LCDDATA6,5)
// LCDDATA12<S05C2>
extern volatile __bit                   S05C2               __at(0x7B95);	// @ (0xF72 * 8 + 5)
#define                                 S05C2_bit           _BIT_ACCESS(LCDDATA12,5)
// LCDDATA18<S05C3>
extern volatile __bit                   S05C3               __at(0x7BC5);	// @ (0xF78 * 8 + 5)
#define                                 S05C3_bit           _BIT_ACCESS(LCDDATA18,5)
// LCDDATA0<S06C0>
extern volatile __bit                   S06C0               __at(0x7B36);	// @ (0xF66 * 8 + 6)
#define                                 S06C0_bit           _BIT_ACCESS(LCDDATA0,6)
// LCDDATA6<S06C1>
extern volatile __bit                   S06C1               __at(0x7B66);	// @ (0xF6C * 8 + 6)
#define                                 S06C1_bit           _BIT_ACCESS(LCDDATA6,6)
// LCDDATA12<S06C2>
extern volatile __bit                   S06C2               __at(0x7B96);	// @ (0xF72 * 8 + 6)
#define                                 S06C2_bit           _BIT_ACCESS(LCDDATA12,6)
// LCDDATA18<S06C3>
extern volatile __bit                   S06C3               __at(0x7BC6);	// @ (0xF78 * 8 + 6)
#define                                 S06C3_bit           _BIT_ACCESS(LCDDATA18,6)
// LCDDATA0<S07C0>
extern volatile __bit                   S07C0               __at(0x7B37);	// @ (0xF66 * 8 + 7)
#define                                 S07C0_bit           _BIT_ACCESS(LCDDATA0,7)
// LCDDATA6<S07C1>
extern volatile __bit                   S07C1               __at(0x7B67);	// @ (0xF6C * 8 + 7)
#define                                 S07C1_bit           _BIT_ACCESS(LCDDATA6,7)
// LCDDATA12<S07C2>
extern volatile __bit                   S07C2               __at(0x7B97);	// @ (0xF72 * 8 + 7)
#define                                 S07C2_bit           _BIT_ACCESS(LCDDATA12,7)
// LCDDATA18<S07C3>
extern volatile __bit                   S07C3               __at(0x7BC7);	// @ (0xF78 * 8 + 7)
#define                                 S07C3_bit           _BIT_ACCESS(LCDDATA18,7)
// LCDDATA1<S08C0>
extern volatile __bit                   S08C0               __at(0x7B38);	// @ (0xF67 * 8 + 0)
#define                                 S08C0_bit           _BIT_ACCESS(LCDDATA1,0)
// LCDDATA7<S08C1>
extern volatile __bit                   S08C1               __at(0x7B68);	// @ (0xF6D * 8 + 0)
#define                                 S08C1_bit           _BIT_ACCESS(LCDDATA7,0)
// LCDDATA13<S08C2>
extern volatile __bit                   S08C2               __at(0x7B98);	// @ (0xF73 * 8 + 0)
#define                                 S08C2_bit           _BIT_ACCESS(LCDDATA13,0)
// LCDDATA19<S08C3>
extern volatile __bit                   S08C3               __at(0x7BC8);	// @ (0xF79 * 8 + 0)
#define                                 S08C3_bit           _BIT_ACCESS(LCDDATA19,0)
// LCDDATA1<S09C0>
extern volatile __bit                   S09C0               __at(0x7B39);	// @ (0xF67 * 8 + 1)
#define                                 S09C0_bit           _BIT_ACCESS(LCDDATA1,1)
// LCDDATA7<S09C1>
extern volatile __bit                   S09C1               __at(0x7B69);	// @ (0xF6D * 8 + 1)
#define                                 S09C1_bit           _BIT_ACCESS(LCDDATA7,1)
// LCDDATA13<S09C2>
extern volatile __bit                   S09C2               __at(0x7B99);	// @ (0xF73 * 8 + 1)
#define                                 S09C2_bit           _BIT_ACCESS(LCDDATA13,1)
// LCDDATA19<S09C3>
extern volatile __bit                   S09C3               __at(0x7BC9);	// @ (0xF79 * 8 + 1)
#define                                 S09C3_bit           _BIT_ACCESS(LCDDATA19,1)
// LCDDATA1<S10C0>
extern volatile __bit                   S10C0               __at(0x7B3A);	// @ (0xF67 * 8 + 2)
#define                                 S10C0_bit           _BIT_ACCESS(LCDDATA1,2)
// LCDDATA7<S10C1>
extern volatile __bit                   S10C1               __at(0x7B6A);	// @ (0xF6D * 8 + 2)
#define                                 S10C1_bit           _BIT_ACCESS(LCDDATA7,2)
// LCDDATA13<S10C2>
extern volatile __bit                   S10C2               __at(0x7B9A);	// @ (0xF73 * 8 + 2)
#define                                 S10C2_bit           _BIT_ACCESS(LCDDATA13,2)
// LCDDATA19<S10C3>
extern volatile __bit                   S10C3               __at(0x7BCA);	// @ (0xF79 * 8 + 2)
#define                                 S10C3_bit           _BIT_ACCESS(LCDDATA19,2)
// LCDDATA1<S11C0>
extern volatile __bit                   S11C0               __at(0x7B3B);	// @ (0xF67 * 8 + 3)
#define                                 S11C0_bit           _BIT_ACCESS(LCDDATA1,3)
// LCDDATA7<S11C1>
extern volatile __bit                   S11C1               __at(0x7B6B);	// @ (0xF6D * 8 + 3)
#define                                 S11C1_bit           _BIT_ACCESS(LCDDATA7,3)
// LCDDATA13<S11C2>
extern volatile __bit                   S11C2               __at(0x7B9B);	// @ (0xF73 * 8 + 3)
#define                                 S11C2_bit           _BIT_ACCESS(LCDDATA13,3)
// LCDDATA19<S11C3>
extern volatile __bit                   S11C3               __at(0x7BCB);	// @ (0xF79 * 8 + 3)
#define                                 S11C3_bit           _BIT_ACCESS(LCDDATA19,3)
// LCDDATA1<S12C0>
extern volatile __bit                   S12C0               __at(0x7B3C);	// @ (0xF67 * 8 + 4)
#define                                 S12C0_bit           _BIT_ACCESS(LCDDATA1,4)
// LCDDATA7<S12C1>
extern volatile __bit                   S12C1               __at(0x7B6C);	// @ (0xF6D * 8 + 4)
#define                                 S12C1_bit           _BIT_ACCESS(LCDDATA7,4)
// LCDDATA13<S12C2>
extern volatile __bit                   S12C2               __at(0x7B9C);	// @ (0xF73 * 8 + 4)
#define                                 S12C2_bit           _BIT_ACCESS(LCDDATA13,4)
// LCDDATA19<S12C3>
extern volatile __bit                   S12C3               __at(0x7BCC);	// @ (0xF79 * 8 + 4)
#define                                 S12C3_bit           _BIT_ACCESS(LCDDATA19,4)
// LCDDATA1<S13C0>
extern volatile __bit                   S13C0               __at(0x7B3D);	// @ (0xF67 * 8 + 5)
#define                                 S13C0_bit           _BIT_ACCESS(LCDDATA1,5)
// LCDDATA7<S13C1>
extern volatile __bit                   S13C1               __at(0x7B6D);	// @ (0xF6D * 8 + 5)
#define                                 S13C1_bit           _BIT_ACCESS(LCDDATA7,5)
// LCDDATA13<S13C2>
extern volatile __bit                   S13C2               __at(0x7B9D);	// @ (0xF73 * 8 + 5)
#define                                 S13C2_bit           _BIT_ACCESS(LCDDATA13,5)
// LCDDATA19<S13C3>
extern volatile __bit                   S13C3               __at(0x7BCD);	// @ (0xF79 * 8 + 5)
#define                                 S13C3_bit           _BIT_ACCESS(LCDDATA19,5)
// LCDDATA1<S14C0>
extern volatile __bit                   S14C0               __at(0x7B3E);	// @ (0xF67 * 8 + 6)
#define                                 S14C0_bit           _BIT_ACCESS(LCDDATA1,6)
// LCDDATA7<S14C1>
extern volatile __bit                   S14C1               __at(0x7B6E);	// @ (0xF6D * 8 + 6)
#define                                 S14C1_bit           _BIT_ACCESS(LCDDATA7,6)
// LCDDATA13<S14C2>
extern volatile __bit                   S14C2               __at(0x7B9E);	// @ (0xF73 * 8 + 6)
#define                                 S14C2_bit           _BIT_ACCESS(LCDDATA13,6)
// LCDDATA19<S14C3>
extern volatile __bit                   S14C3               __at(0x7BCE);	// @ (0xF79 * 8 + 6)
