MikroElektronika/core_packages/PIC/XC8/def/PIC18F65K90/mcu.h
#define                                 SE31_bit            _BIT_ACCESS(LCDSE3,7)
// LCDSE4<SE32>
extern volatile __bit                   SE32                __at(0x77D0);	// @ (0xEFA * 8 + 0)
#define                                 SE32_bit            _BIT_ACCESS(LCDSE4,0)
// PORTD<SEG0>
extern volatile __bit                   SEG0                __at(0x7C18);	// @ (0xF83 * 8 + 0)
#define                                 SEG0_bit            _BIT_ACCESS(PORTD,0)
// PORTD<SEG1>
extern volatile __bit                   SEG1                __at(0x7C19);	// @ (0xF83 * 8 + 1)
#define                                 SEG1_bit            _BIT_ACCESS(PORTD,1)
// PORTB<SEG10>
extern volatile __bit                   SEG10               __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 SEG10_bit           _BIT_ACCESS(PORTB,3)
// PORTB<SEG11>
extern volatile __bit                   SEG11               __at(0x7C0C);	// @ (0xF81 * 8 + 4)
#define                                 SEG11_bit           _BIT_ACCESS(PORTB,4)
// PORTC<SEG12>
extern volatile __bit                   SEG12               __at(0x7C15);	// @ (0xF82 * 8 + 5)
#define                                 SEG12_bit           _BIT_ACCESS(PORTC,5)
// PORTC<SEG13>
extern volatile __bit                   SEG13               __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 SEG13_bit           _BIT_ACCESS(PORTC,2)
// PORTA<SEG14>
extern volatile __bit                   SEG14               __at(0x7C04);	// @ (0xF80 * 8 + 4)
#define                                 SEG14_bit           _BIT_ACCESS(PORTA,4)
// PORTA<SEG15>
extern volatile __bit                   SEG15               __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 SEG15_bit           _BIT_ACCESS(PORTA,5)
// PORTC<SEG16>
extern volatile __bit                   SEG16               __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 SEG16_bit           _BIT_ACCESS(PORTC,4)
// PORTC<SEG17>
extern volatile __bit                   SEG17               __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 SEG17_bit           _BIT_ACCESS(PORTC,3)
// PORTA<SEG18>
extern volatile __bit                   SEG18               __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 SEG18_bit           _BIT_ACCESS(PORTA,1)
// PORTF<SEG19>
extern volatile __bit                   SEG19               __at(0x7C29);	// @ (0xF85 * 8 + 1)
#define                                 SEG19_bit           _BIT_ACCESS(PORTF,1)
// PORTD<SEG2>
extern volatile __bit                   SEG2                __at(0x7C1A);	// @ (0xF83 * 8 + 2)
#define                                 SEG2_bit            _BIT_ACCESS(PORTD,2)
// PORTF<SEG20>
extern volatile __bit                   SEG20               __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 SEG20_bit           _BIT_ACCESS(PORTF,2)
// PORTF<SEG21>
extern volatile __bit                   SEG21               __at(0x7C2B);	// @ (0xF85 * 8 + 3)
#define                                 SEG21_bit           _BIT_ACCESS(PORTF,3)
// PORTF<SEG22>
extern volatile __bit                   SEG22               __at(0x7C2C);	// @ (0xF85 * 8 + 4)
#define                                 SEG22_bit           _BIT_ACCESS(PORTF,4)
// PORTF<SEG23>
extern volatile __bit                   SEG23               __at(0x7C2D);	// @ (0xF85 * 8 + 5)
#define                                 SEG23_bit           _BIT_ACCESS(PORTF,5)
// PORTF<SEG24>
extern volatile __bit                   SEG24               __at(0x7C2E);	// @ (0xF85 * 8 + 6)
#define                                 SEG24_bit           _BIT_ACCESS(PORTF,6)
// PORTF<SEG25>
extern volatile __bit                   SEG25               __at(0x7C2F);	// @ (0xF85 * 8 + 7)
#define                                 SEG25_bit           _BIT_ACCESS(PORTF,7)
// PORTG<SEG26>
extern volatile __bit                   SEG26               __at(0x7C34);	// @ (0xF86 * 8 + 4)
#define                                 SEG26_bit           _BIT_ACCESS(PORTG,4)
// PORTC<SEG27>
extern volatile __bit                   SEG27               __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 SEG27_bit           _BIT_ACCESS(PORTC,6)
// PORTC<SEG28>
extern volatile __bit                   SEG28               __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 SEG28_bit           _BIT_ACCESS(PORTC,7)
// PORTB<SEG29>
extern volatile __bit                   SEG29               __at(0x7C0D);	// @ (0xF81 * 8 + 5)
#define                                 SEG29_bit           _BIT_ACCESS(PORTB,5)
// PORTD<SEG3>
extern volatile __bit                   SEG3                __at(0x7C1B);	// @ (0xF83 * 8 + 3)
#define                                 SEG3_bit            _BIT_ACCESS(PORTD,3)
// PORTB<SEG30>
extern volatile __bit                   SEG30               __at(0x7C08);	// @ (0xF81 * 8 + 0)
#define                                 SEG30_bit           _BIT_ACCESS(PORTB,0)
// PORTE<SEG31>
extern volatile __bit                   SEG31               __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 SEG31_bit           _BIT_ACCESS(PORTE,7)
// PORTC<SEG32>
extern volatile __bit                   SEG32               __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 SEG32_bit           _BIT_ACCESS(PORTC,1)
// PORTD<SEG4>
extern volatile __bit                   SEG4                __at(0x7C1C);	// @ (0xF83 * 8 + 4)
#define                                 SEG4_bit            _BIT_ACCESS(PORTD,4)
// PORTD<SEG5>
extern volatile __bit                   SEG5                __at(0x7C1D);	// @ (0xF83 * 8 + 5)
#define                                 SEG5_bit            _BIT_ACCESS(PORTD,5)
// PORTD<SEG6>
extern volatile __bit                   SEG6                __at(0x7C1E);	// @ (0xF83 * 8 + 6)
#define                                 SEG6_bit            _BIT_ACCESS(PORTD,6)
// PORTD<SEG7>
extern volatile __bit                   SEG7                __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 SEG7_bit            _BIT_ACCESS(PORTD,7)
// PORTB<SEG8>
extern volatile __bit                   SEG8                __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 SEG8_bit            _BIT_ACCESS(PORTB,1)
// PORTB<SEG9>
extern volatile __bit                   SEG9                __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 SEG9_bit            _BIT_ACCESS(PORTB,2)
// SSP1CON2<SEN1>
extern volatile __bit                   SEN1                __at(0x7E28);	// @ (0xFC5 * 8 + 0)
#define                                 SEN1_bit            _BIT_ACCESS(SSP1CON2,0)
// SSP2CON2<SEN2>
extern volatile __bit                   SEN2                __at(0x77F0);	// @ (0xEFE * 8 + 0)
#define                                 SEN2_bit            _BIT_ACCESS(SSP2CON2,0)
// TXSTA1<SENDB1>
extern volatile __bit                   SENDB1              __at(0x7D63);	// @ (0xFAC * 8 + 3)
#define                                 SENDB1_bit          _BIT_ACCESS(TXSTA1,3)
// TXSTA2<SENDB2>
extern volatile __bit                   SENDB2              __at(0x790B);	// @ (0xF21 * 8 + 3)
#define                                 SENDB2_bit          _BIT_ACCESS(TXSTA2,3)
// LCDCON<SLPEN>
extern volatile __bit                   SLPEN               __at(0x77A6);	// @ (0xEF4 * 8 + 6)
#define                                 SLPEN_bit           _BIT_ACCESS(LCDCON,6)
// SSP1STAT<SMP1>
extern volatile __bit                   SMP1                __at(0x7E3F);	// @ (0xFC7 * 8 + 7)
#define                                 SMP1_bit            _BIT_ACCESS(SSP1STAT,7)
// SSP2STAT<SMP2>
extern volatile __bit                   SMP2                __at(0x7807);	// @ (0xF00 * 8 + 7)
#define                                 SMP2_bit            _BIT_ACCESS(SSP2STAT,7)
// T3CON<SOSCEN3>
extern volatile __bit                   SOSCEN3             __at(0x7D8B);	// @ (0xFB1 * 8 + 3)
#define                                 SOSCEN3_bit         _BIT_ACCESS(T3CON,3)
// T5CON<SOSCEN5>
extern volatile __bit                   SOSCEN5             __at(0x789B);	// @ (0xF13 * 8 + 3)
#define                                 SOSCEN5_bit         _BIT_ACCESS(T5CON,3)
// OSCCON2<SOSCGO>
extern volatile __bit                   SOSCGO              __at(0x7B23);	// @ (0xF64 * 8 + 3)
#define                                 SOSCGO_bit          _BIT_ACCESS(OSCCON2,3)
// PORTC<SOSCI>
extern volatile __bit                   SOSCI               __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 SOSCI_bit           _BIT_ACCESS(PORTC,1)
// PORTC<SOSCO>
extern volatile __bit                   SOSCO               __at(0x7C10);	// @ (0xF82 * 8 + 0)
#define                                 SOSCO_bit           _BIT_ACCESS(PORTC,0)
// OSCCON2<SOSCRUN>
extern volatile __bit                   SOSCRUN             __at(0x7B26);	// @ (0xF64 * 8 + 6)
#define                                 SOSCRUN_bit         _BIT_ACCESS(OSCCON2,6)
// STKPTR<SP0>
extern volatile __bit                   SP0                 __at(0x7FE0);	// @ (0xFFC * 8 + 0)
#define                                 SP0_bit             _BIT_ACCESS(STKPTR,0)
// STKPTR<SP1>
extern volatile __bit                   SP1                 __at(0x7FE1);	// @ (0xFFC * 8 + 1)
#define                                 SP1_bit             _BIT_ACCESS(STKPTR,1)
// STKPTR<SP2>
extern volatile __bit                   SP2                 __at(0x7FE2);	// @ (0xFFC * 8 + 2)
#define                                 SP2_bit             _BIT_ACCESS(STKPTR,2)
// STKPTR<SP3>
extern volatile __bit                   SP3                 __at(0x7FE3);	// @ (0xFFC * 8 + 3)
#define                                 SP3_bit             _BIT_ACCESS(STKPTR,3)
// STKPTR<SP4>
extern volatile __bit                   SP4                 __at(0x7FE4);	// @ (0xFFC * 8 + 4)
#define                                 SP4_bit             _BIT_ACCESS(STKPTR,4)
// RCSTA1<SPEN1>
extern volatile __bit                   SPEN1               __at(0x7D5F);	// @ (0xFAB * 8 + 7)
#define                                 SPEN1_bit           _BIT_ACCESS(RCSTA1,7)
// RCSTA2<SPEN2>
extern volatile __bit                   SPEN2               __at(0x7917);	// @ (0xF22 * 8 + 7)
#define                                 SPEN2_bit           _BIT_ACCESS(RCSTA2,7)
// PMD0<SPI1MD>
extern volatile __bit                   SPI1MD              __at(0x78C9);	// @ (0xF19 * 8 + 1)
#define                                 SPI1MD_bit          _BIT_ACCESS(PMD0,1)
// ODCON1<SPI1OD>
extern volatile __bit                   SPI1OD              __at(0x794F);	// @ (0xF29 * 8 + 7)
#define                                 SPI1OD_bit          _BIT_ACCESS(ODCON1,7)
// PMD0<SPI2MD>
extern volatile __bit                   SPI2MD              __at(0x78CA);	// @ (0xF19 * 8 + 2)
#define                                 SPI2MD_bit          _BIT_ACCESS(PMD0,2)
// ODCON1<SPI2OD>
extern volatile __bit                   SPI2OD              __at(0x7948);	// @ (0xF29 * 8 + 0)
#define                                 SPI2OD_bit          _BIT_ACCESS(ODCON1,0)
// RCSTA1<SREN1>
extern volatile __bit                   SREN1               __at(0x7D5D);	// @ (0xFAB * 8 + 5)
#define                                 SREN1_bit           _BIT_ACCESS(RCSTA1,5)
// RCSTA2<SREN2>
extern volatile __bit                   SREN2               __at(0x7915);	// @ (0xF22 * 8 + 5)
#define                                 SREN2_bit           _BIT_ACCESS(RCSTA2,5)
// RCSTA1<SRENA>
extern volatile __bit                   SRENA               __at(0x7D5D);	// @ (0xFAB * 8 + 5)
#define                                 SRENA_bit           _BIT_ACCESS(RCSTA1,5)
// WDTCON<SRETEN>
extern volatile __bit                   SRETEN              __at(0x7E8C);	// @ (0xFD1 * 8 + 4)
#define                                 SRETEN_bit          _BIT_ACCESS(WDTCON,4)
// PORTF<SS1>
extern volatile __bit                   SS1                 __at(0x7C2F);	// @ (0xF85 * 8 + 7)
#define                                 SS1_bit             _BIT_ACCESS(PORTF,7)
// PORTD<SS2>
extern volatile __bit                   SS2                 __at(0x7C1F);	// @ (0xF83 * 8 + 7)
#define                                 SS2_bit             _BIT_ACCESS(PORTD,7)
// PIE1<SSP1IE>
extern volatile __bit                   SSP1IE              __at(0x7CEB);	// @ (0xF9D * 8 + 3)
#define                                 SSP1IE_bit          _BIT_ACCESS(PIE1,3)
// PIR1<SSP1IF>
extern volatile __bit                   SSP1IF              __at(0x7CF3);	// @ (0xF9E * 8 + 3)
#define                                 SSP1IF_bit          _BIT_ACCESS(PIR1,3)
// IPR1<SSP1IP>
extern volatile __bit                   SSP1IP              __at(0x7CFB);	// @ (0xF9F * 8 + 3)
#define                                 SSP1IP_bit          _BIT_ACCESS(IPR1,3)
// PMD0<SSP1MD>
extern volatile __bit                   SSP1MD              __at(0x78C9);	// @ (0xF19 * 8 + 1)
#define                                 SSP1MD_bit          _BIT_ACCESS(PMD0,1)
// PIE2<SSP2IE>
extern volatile __bit                   SSP2IE              __at(0x7D05);	// @ (0xFA0 * 8 + 5)
#define                                 SSP2IE_bit          _BIT_ACCESS(PIE2,5)
// PIR2<SSP2IF>
extern volatile __bit                   SSP2IF              __at(0x7D0D);	// @ (0xFA1 * 8 + 5)
#define                                 SSP2IF_bit          _BIT_ACCESS(PIR2,5)
// IPR2<SSP2IP>
extern volatile __bit                   SSP2IP              __at(0x7D15);	// @ (0xFA2 * 8 + 5)
#define                                 SSP2IP_bit          _BIT_ACCESS(IPR2,5)
// PMD0<SSP2MD>
extern volatile __bit                   SSP2MD              __at(0x78CA);	// @ (0xF19 * 8 + 2)
#define                                 SSP2MD_bit          _BIT_ACCESS(PMD0,2)
// SSP1CON1<SSPEN1>
extern volatile __bit                   SSPEN1              __at(0x7E35);	// @ (0xFC6 * 8 + 5)
#define                                 SSPEN1_bit          _BIT_ACCESS(SSP1CON1,5)
// SSP2CON1<SSPEN2>
extern volatile __bit                   SSPEN2              __at(0x77FD);	// @ (0xEFF * 8 + 5)
#define                                 SSPEN2_bit          _BIT_ACCESS(SSP2CON1,5)
// PIE1<SSPIE>
extern volatile __bit                   SSPIE               __at(0x7CEB);	// @ (0xF9D * 8 + 3)
#define                                 SSPIE_bit           _BIT_ACCESS(PIE1,3)
// PIR1<SSPIF>
extern volatile __bit                   SSPIF               __at(0x7CF3);	// @ (0xF9E * 8 + 3)
#define                                 SSPIF_bit           _BIT_ACCESS(PIR1,3)
// IPR1<SSPIP>
extern volatile __bit                   SSPIP               __at(0x7CFB);	// @ (0xF9F * 8 + 3)
#define                                 SSPIP_bit           _BIT_ACCESS(IPR1,3)
// SSP1CON1<SSPM01>
extern volatile __bit                   SSPM01              __at(0x7E30);	// @ (0xFC6 * 8 + 0)
#define                                 SSPM01_bit          _BIT_ACCESS(SSP1CON1,0)
// LCDDATA12<SSPM012>
extern volatile __bit                   SSPM012             __at(0x7B90);	// @ (0xF72 * 8 + 0)
#define                                 SSPM012_bit         _BIT_ACCESS(LCDDATA12,0)
// SSP2CON1<SSPM02>
extern volatile __bit                   SSPM02              __at(0x77F8);	// @ (0xEFF * 8 + 0)
#define                                 SSPM02_bit          _BIT_ACCESS(SSP2CON1,0)
// SSP1CON1<SSPM11>
extern volatile __bit                   SSPM11              __at(0x7E31);	// @ (0xFC6 * 8 + 1)
#define                                 SSPM11_bit          _BIT_ACCESS(SSP1CON1,1)
// LCDDATA12<SSPM112>
extern volatile __bit                   SSPM112             __at(0x7B91);	// @ (0xF72 * 8 + 1)
#define                                 SSPM112_bit         _BIT_ACCESS(LCDDATA12,1)
// SSP2CON1<SSPM12>
extern volatile __bit                   SSPM12              __at(0x77F9);	// @ (0xEFF * 8 + 1)
#define                                 SSPM12_bit          _BIT_ACCESS(SSP2CON1,1)
// SSP1CON1<SSPM21>
extern volatile __bit                   SSPM21              __at(0x7E32);	// @ (0xFC6 * 8 + 2)
#define                                 SSPM21_bit          _BIT_ACCESS(SSP1CON1,2)
// LCDDATA12<SSPM212>
extern volatile __bit                   SSPM212             __at(0x7B92);	// @ (0xF72 * 8 + 2)
#define                                 SSPM212_bit         _BIT_ACCESS(LCDDATA12,2)
// SSP2CON1<SSPM22>
extern volatile __bit                   SSPM22              __at(0x77FA);	// @ (0xEFF * 8 + 2)
#define                                 SSPM22_bit          _BIT_ACCESS(SSP2CON1,2)
// SSP1CON1<SSPM31>
extern volatile __bit                   SSPM31              __at(0x7E33);	// @ (0xFC6 * 8 + 3)
#define                                 SSPM31_bit          _BIT_ACCESS(SSP1CON1,3)
// LCDDATA12<SSPM312>
extern volatile __bit                   SSPM312             __at(0x7B93);	// @ (0xF72 * 8 + 3)
#define                                 SSPM312_bit         _BIT_ACCESS(LCDDATA12,3)
// SSP2CON1<SSPM32>
extern volatile __bit                   SSPM32              __at(0x77FB);	// @ (0xEFF * 8 + 3)
#define                                 SSPM32_bit          _BIT_ACCESS(SSP2CON1,3)
// SSP1CON1<SSPOV1>
extern volatile __bit                   SSPOV1              __at(0x7E36);	// @ (0xFC6 * 8 + 6)
#define                                 SSPOV1_bit          _BIT_ACCESS(SSP1CON1,6)
// SSP2CON1<SSPOV2>
extern volatile __bit                   SSPOV2              __at(0x77FE);	// @ (0xEFF * 8 + 6)
#define                                 SSPOV2_bit          _BIT_ACCESS(SSP2CON1,6)
// SSP1STAT<START>
extern volatile __bit                   START               __at(0x7E3B);	// @ (0xFC7 * 8 + 3)
#define                                 START_bit           _BIT_ACCESS(SSP1STAT,3)
// SSP1STAT<START1>
extern volatile __bit                   START1              __at(0x7E3B);	// @ (0xFC7 * 8 + 3)
#define                                 START1_bit          _BIT_ACCESS(SSP1STAT,3)
// SSP2STAT<START2>
extern volatile __bit                   START2              __at(0x7803);	// @ (0xF00 * 8 + 3)
#define                                 START2_bit          _BIT_ACCESS(SSP2STAT,3)
// STKPTR<STKFUL>
extern volatile __bit                   STKFUL              __at(0x7FE7);	// @ (0xFFC * 8 + 7)
#define                                 STKFUL_bit          _BIT_ACCESS(STKPTR,7)
// STKPTR<STKOVF>
extern volatile __bit                   STKOVF              __at(0x7FE7);	// @ (0xFFC * 8 + 7)
#define                                 STKOVF_bit          _BIT_ACCESS(STKPTR,7)
// STKPTR<STKUNF>
extern volatile __bit                   STKUNF              __at(0x7FE6);	// @ (0xFFC * 8 + 6)
#define                                 STKUNF_bit          _BIT_ACCESS(STKPTR,6)
// SSP1STAT<STOP>
extern volatile __bit                   STOP                __at(0x7E3C);	// @ (0xFC7 * 8 + 4)
#define                                 STOP_bit            _BIT_ACCESS(SSP1STAT,4)
// SSP1STAT<STOP1>
extern volatile __bit                   STOP1               __at(0x7E3C);	// @ (0xFC7 * 8 + 4)
#define                                 STOP1_bit           _BIT_ACCESS(SSP1STAT,4)
// SSP2STAT<STOP2>
extern volatile __bit                   STOP2               __at(0x7804);	// @ (0xF00 * 8 + 4)
#define                                 STOP2_bit           _BIT_ACCESS(SSP2STAT,4)
// PSTR2CON<STRA2>
extern volatile __bit                   STRA2               __at(0x78D8);	// @ (0xF1B * 8 + 0)
#define                                 STRA2_bit           _BIT_ACCESS(PSTR2CON,0)
// PSTR3CON<STRA3>
extern volatile __bit                   STRA3               __at(0x78D0);	// @ (0xF1A * 8 + 0)
#define                                 STRA3_bit           _BIT_ACCESS(PSTR3CON,0)
// PSTR2CON<STRB2>
extern volatile __bit                   STRB2               __at(0x78D9);	// @ (0xF1B * 8 + 1)
#define                                 STRB2_bit           _BIT_ACCESS(PSTR2CON,1)
// PSTR3CON<STRB3>
extern volatile __bit                   STRB3               __at(0x78D1);	// @ (0xF1A * 8 + 1)
#define                                 STRB3_bit           _BIT_ACCESS(PSTR3CON,1)
// PSTR2CON<STRC2>
extern volatile __bit                   STRC2               __at(0x78DA);	// @ (0xF1B * 8 + 2)
#define                                 STRC2_bit           _BIT_ACCESS(PSTR2CON,2)
// PSTR3CON<STRC3>
extern volatile __bit                   STRC3               __at(0x78D2);	// @ (0xF1A * 8 + 2)
#define                                 STRC3_bit           _BIT_ACCESS(PSTR3CON,2)
// PSTR2CON<STRD2>
extern volatile __bit                   STRD2               __at(0x78DB);	// @ (0xF1B * 8 + 3)
#define                                 STRD2_bit           _BIT_ACCESS(PSTR2CON,3)
// PSTR3CON<STRD3>
extern volatile __bit                   STRD3               __at(0x78D3);	// @ (0xF1A * 8 + 3)
#define                                 STRD3_bit           _BIT_ACCESS(PSTR3CON,3)
// PSTR2CON<STRSYNC2>
extern volatile __bit                   STRSYNC2            __at(0x78DC);	// @ (0xF1B * 8 + 4)
#define                                 STRSYNC2_bit        _BIT_ACCESS(PSTR2CON,4)
// PSTR3CON<STRSYNC3>
extern volatile __bit                   STRSYNC3            __at(0x78D4);	// @ (0xF1A * 8 + 4)
#define                                 STRSYNC3_bit        _BIT_ACCESS(PSTR3CON,4)
// WDTCON<SWDTE>
extern volatile __bit                   SWDTE               __at(0x7E88);	// @ (0xFD1 * 8 + 0)
#define                                 SWDTE_bit           _BIT_ACCESS(WDTCON,0)
// WDTCON<SWDTEN>
extern volatile __bit                   SWDTEN              __at(0x7E88);	// @ (0xFD1 * 8 + 0)
#define                                 SWDTEN_bit          _BIT_ACCESS(WDTCON,0)
// TXSTA1<SYNC1>
extern volatile __bit                   SYNC1               __at(0x7D64);	// @ (0xFAC * 8 + 4)
#define                                 SYNC1_bit           _BIT_ACCESS(TXSTA1,4)
// TXSTA2<SYNC2>
extern volatile __bit                   SYNC2               __at(0x790C);	// @ (0xF21 * 8 + 4)
#define                                 SYNC2_bit           _BIT_ACCESS(TXSTA2,4)
// T0CON<T08BIT>
extern volatile __bit                   T08BIT              __at(0x7EAE);	// @ (0xFD5 * 8 + 6)
#define                                 T08BIT_bit          _BIT_ACCESS(T0CON,6)
// PORTA<T0CKI>
extern volatile __bit                   T0CKI               __at(0x7C04);	// @ (0xF80 * 8 + 4)
#define                                 T0CKI_bit           _BIT_ACCESS(PORTA,4)
// T0CON<T0CS>
extern volatile __bit                   T0CS                __at(0x7EAD);	// @ (0xFD5 * 8 + 5)
#define                                 T0CS_bit            _BIT_ACCESS(T0CON,5)
// INTCON<T0IE>
extern volatile __bit                   T0IE                __at(0x7F95);	// @ (0xFF2 * 8 + 5)
#define                                 T0IE_bit            _BIT_ACCESS(INTCON,5)
// INTCON<T0IF>
extern volatile __bit                   T0IF                __at(0x7F92);	// @ (0xFF2 * 8 + 2)
#define                                 T0IF_bit            _BIT_ACCESS(INTCON,2)
// INTCON2<T0IP>
extern volatile __bit                   T0IP                __at(0x7F8A);	// @ (0xFF1 * 8 + 2)
#define                                 T0IP_bit            _BIT_ACCESS(INTCON2,2)
// T0CON<T0PS0>
extern volatile __bit                   T0PS0               __at(0x7EA8);	// @ (0xFD5 * 8 + 0)
#define                                 T0PS0_bit           _BIT_ACCESS(T0CON,0)
// T0CON<T0PS1>
extern volatile __bit                   T0PS1               __at(0x7EA9);	// @ (0xFD5 * 8 + 1)
#define                                 T0PS1_bit           _BIT_ACCESS(T0CON,1)
// T0CON<T0PS2>
extern volatile __bit                   T0PS2               __at(0x7EAA);	// @ (0xFD5 * 8 + 2)
#define                                 T0PS2_bit           _BIT_ACCESS(T0CON,2)
// T0CON<T0SE>
