MikroElektronika/core_packages/PIC/XC8/def/PIC18F65K90/mcu.h
extern volatile __bit                   T0SE                __at(0x7EAC);	// @ (0xFD5 * 8 + 4)
#define                                 T0SE_bit            _BIT_ACCESS(T0CON,4)
// PORTA<T1CKI>
extern volatile __bit                   T1CKI               __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 T1CKI_bit           _BIT_ACCESS(PORTA,5)
// T1CON<T1CKPS0>
extern volatile __bit                   T1CKPS0             __at(0x7E6C);	// @ (0xFCD * 8 + 4)
#define                                 T1CKPS0_bit         _BIT_ACCESS(T1CON,4)
// T1CON<T1CKPS1>
extern volatile __bit                   T1CKPS1             __at(0x7E6D);	// @ (0xFCD * 8 + 5)
#define                                 T1CKPS1_bit         _BIT_ACCESS(T1CON,5)
// PORTB<T1G>
extern volatile __bit                   T1G                 __at(0x7C0D);	// @ (0xF81 * 8 + 5)
#define                                 T1G_bit             _BIT_ACCESS(PORTB,5)
// T1GCON<T1GGO>
extern volatile __bit                   T1GGO               __at(0x7D53);	// @ (0xFAA * 8 + 3)
#define                                 T1GGO_bit           _BIT_ACCESS(T1GCON,3)
// T1GCON<T1GGO_NOT_T1DONE>
extern volatile __bit                   T1GGO_NOT_T1DONE    __at(0x7D53);	// @ (0xFAA * 8 + 3)
#define                                 T1GGO_NOT_T1DONE_bit _BIT_ACCESS(T1GCON,3)
// T1GCON<T1GGO_nT1DONE>
extern volatile __bit                   T1GGO_nT1DONE       __at(0x7D53);	// @ (0xFAA * 8 + 3)
#define                                 T1GGO_nT1DONE_bit   _BIT_ACCESS(T1GCON,3)
// T1GCON<T1GPOL>
extern volatile __bit                   T1GPOL              __at(0x7D56);	// @ (0xFAA * 8 + 6)
#define                                 T1GPOL_bit          _BIT_ACCESS(T1GCON,6)
// T1GCON<T1GSPM>
extern volatile __bit                   T1GSPM              __at(0x7D54);	// @ (0xFAA * 8 + 4)
#define                                 T1GSPM_bit          _BIT_ACCESS(T1GCON,4)
// T1GCON<T1GSS0>
extern volatile __bit                   T1GSS0              __at(0x7D50);	// @ (0xFAA * 8 + 0)
#define                                 T1GSS0_bit          _BIT_ACCESS(T1GCON,0)
// T1GCON<T1GSS1>
extern volatile __bit                   T1GSS1              __at(0x7D51);	// @ (0xFAA * 8 + 1)
#define                                 T1GSS1_bit          _BIT_ACCESS(T1GCON,1)
// T1GCON<T1GTM>
extern volatile __bit                   T1GTM               __at(0x7D55);	// @ (0xFAA * 8 + 5)
#define                                 T1GTM_bit           _BIT_ACCESS(T1GCON,5)
// T1GCON<T1GVAL>
extern volatile __bit                   T1GVAL              __at(0x7D52);	// @ (0xFAA * 8 + 2)
#define                                 T1GVAL_bit          _BIT_ACCESS(T1GCON,2)
// T1CON<T1OSCEN>
extern volatile __bit                   T1OSCEN             __at(0x7E6B);	// @ (0xFCD * 8 + 3)
#define                                 T1OSCEN_bit         _BIT_ACCESS(T1CON,3)
// T1CON<T1RD16>
extern volatile __bit                   T1RD16              __at(0x7E6F);	// @ (0xFCD * 8 + 7)
#define                                 T1RD16_bit          _BIT_ACCESS(T1CON,7)
// T2CON<T2CKPS0>
extern volatile __bit                   T2CKPS0             __at(0x7E50);	// @ (0xFCA * 8 + 0)
#define                                 T2CKPS0_bit         _BIT_ACCESS(T2CON,0)
// T2CON<T2CKPS1>
extern volatile __bit                   T2CKPS1             __at(0x7E51);	// @ (0xFCA * 8 + 1)
#define                                 T2CKPS1_bit         _BIT_ACCESS(T2CON,1)
// T2CON<T2OUTPS0>
extern volatile __bit                   T2OUTPS0            __at(0x7E53);	// @ (0xFCA * 8 + 3)
#define                                 T2OUTPS0_bit        _BIT_ACCESS(T2CON,3)
// T2CON<T2OUTPS1>
extern volatile __bit                   T2OUTPS1            __at(0x7E54);	// @ (0xFCA * 8 + 4)
#define                                 T2OUTPS1_bit        _BIT_ACCESS(T2CON,4)
// T2CON<T2OUTPS2>
extern volatile __bit                   T2OUTPS2            __at(0x7E55);	// @ (0xFCA * 8 + 5)
#define                                 T2OUTPS2_bit        _BIT_ACCESS(T2CON,5)
// T2CON<T2OUTPS3>
extern volatile __bit                   T2OUTPS3            __at(0x7E56);	// @ (0xFCA * 8 + 6)
#define                                 T2OUTPS3_bit        _BIT_ACCESS(T2CON,6)
// PORTB<T3CKI>
extern volatile __bit                   T3CKI               __at(0x7C0D);	// @ (0xF81 * 8 + 5)
#define                                 T3CKI_bit           _BIT_ACCESS(PORTB,5)
// T3CON<T3CKPS0>
extern volatile __bit                   T3CKPS0             __at(0x7D8C);	// @ (0xFB1 * 8 + 4)
#define                                 T3CKPS0_bit         _BIT_ACCESS(T3CON,4)
// LCDDATA19<T3CKPS019>
extern volatile __bit                   T3CKPS019           __at(0x7BCC);	// @ (0xF79 * 8 + 4)
#define                                 T3CKPS019_bit       _BIT_ACCESS(LCDDATA19,4)
// T3CON<T3CKPS1>
extern volatile __bit                   T3CKPS1             __at(0x7D8D);	// @ (0xFB1 * 8 + 5)
#define                                 T3CKPS1_bit         _BIT_ACCESS(T3CON,5)
// LCDDATA19<T3CKPS119>
extern volatile __bit                   T3CKPS119           __at(0x7BCD);	// @ (0xF79 * 8 + 5)
#define                                 T3CKPS119_bit       _BIT_ACCESS(LCDDATA19,5)
// PORTA<T3G>
extern volatile __bit                   T3G                 __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 T3G_bit             _BIT_ACCESS(PORTA,5)
// T3GCON<T3GGO>
extern volatile __bit                   T3GGO               __at(0x7D83);	// @ (0xFB0 * 8 + 3)
#define                                 T3GGO_bit           _BIT_ACCESS(T3GCON,3)
// T3GCON<T3GGO_NOT_T3DONE>
extern volatile __bit                   T3GGO_NOT_T3DONE    __at(0x7D83);	// @ (0xFB0 * 8 + 3)
#define                                 T3GGO_NOT_T3DONE_bit _BIT_ACCESS(T3GCON,3)
// T3GCON<T3GGO_nT3DONE>
extern volatile __bit                   T3GGO_nT3DONE       __at(0x7D83);	// @ (0xFB0 * 8 + 3)
#define                                 T3GGO_nT3DONE_bit   _BIT_ACCESS(T3GCON,3)
// T3GCON<T3GPOL>
extern volatile __bit                   T3GPOL              __at(0x7D86);	// @ (0xFB0 * 8 + 6)
#define                                 T3GPOL_bit          _BIT_ACCESS(T3GCON,6)
// T3GCON<T3GSPM>
extern volatile __bit                   T3GSPM              __at(0x7D84);	// @ (0xFB0 * 8 + 4)
#define                                 T3GSPM_bit          _BIT_ACCESS(T3GCON,4)
// T3GCON<T3GSS0>
extern volatile __bit                   T3GSS0              __at(0x7D80);	// @ (0xFB0 * 8 + 0)
#define                                 T3GSS0_bit          _BIT_ACCESS(T3GCON,0)
// T3GCON<T3GSS1>
extern volatile __bit                   T3GSS1              __at(0x7D81);	// @ (0xFB0 * 8 + 1)
#define                                 T3GSS1_bit          _BIT_ACCESS(T3GCON,1)
// T3GCON<T3GTM>
extern volatile __bit                   T3GTM               __at(0x7D85);	// @ (0xFB0 * 8 + 5)
#define                                 T3GTM_bit           _BIT_ACCESS(T3GCON,5)
// T3GCON<T3GVAL>
extern volatile __bit                   T3GVAL              __at(0x7D82);	// @ (0xFB0 * 8 + 2)
#define                                 T3GVAL_bit          _BIT_ACCESS(T3GCON,2)
// T3CON<T3RD16>
extern volatile __bit                   T3RD16              __at(0x7D8F);	// @ (0xFB1 * 8 + 7)
#define                                 T3RD16_bit          _BIT_ACCESS(T3CON,7)
// T4CON<T4CKPS0>
extern volatile __bit                   T4CKPS0             __at(0x7818);	// @ (0xF03 * 8 + 0)
#define                                 T4CKPS0_bit         _BIT_ACCESS(T4CON,0)
// LCDDATA16<T4CKPS016>
extern volatile __bit                   T4CKPS016           __at(0x7BB0);	// @ (0xF76 * 8 + 0)
#define                                 T4CKPS016_bit       _BIT_ACCESS(LCDDATA16,0)
// T4CON<T4CKPS1>
extern volatile __bit                   T4CKPS1             __at(0x7819);	// @ (0xF03 * 8 + 1)
#define                                 T4CKPS1_bit         _BIT_ACCESS(T4CON,1)
// T4CON<T4OUTPS0>
extern volatile __bit                   T4OUTPS0            __at(0x781B);	// @ (0xF03 * 8 + 3)
#define                                 T4OUTPS0_bit        _BIT_ACCESS(T4CON,3)
// T4CON<T4OUTPS1>
extern volatile __bit                   T4OUTPS1            __at(0x781C);	// @ (0xF03 * 8 + 4)
#define                                 T4OUTPS1_bit        _BIT_ACCESS(T4CON,4)
// T4CON<T4OUTPS2>
extern volatile __bit                   T4OUTPS2            __at(0x781D);	// @ (0xF03 * 8 + 5)
#define                                 T4OUTPS2_bit        _BIT_ACCESS(T4CON,5)
// T4CON<T4OUTPS3>
extern volatile __bit                   T4OUTPS3            __at(0x781E);	// @ (0xF03 * 8 + 6)
#define                                 T4OUTPS3_bit        _BIT_ACCESS(T4CON,6)
// PORTD<T5CKI>
extern volatile __bit                   T5CKI               __at(0x7C19);	// @ (0xF83 * 8 + 1)
#define                                 T5CKI_bit           _BIT_ACCESS(PORTD,1)
// T5CON<T5CKPS0>
extern volatile __bit                   T5CKPS0             __at(0x789C);	// @ (0xF13 * 8 + 4)
#define                                 T5CKPS0_bit         _BIT_ACCESS(T5CON,4)
// T5CON<T5CKPS1>
extern volatile __bit                   T5CKPS1             __at(0x789D);	// @ (0xF13 * 8 + 5)
#define                                 T5CKPS1_bit         _BIT_ACCESS(T5CON,5)
// PORTG<T5G>
extern volatile __bit                   T5G                 __at(0x7C34);	// @ (0xF86 * 8 + 4)
#define                                 T5G_bit             _BIT_ACCESS(PORTG,4)
// T5GCON<T5GGO>
extern volatile __bit                   T5GGO               __at(0x7893);	// @ (0xF12 * 8 + 3)
#define                                 T5GGO_bit           _BIT_ACCESS(T5GCON,3)
// T5GCON<T5GGO_NOT_T5DONE>
extern volatile __bit                   T5GGO_NOT_T5DONE    __at(0x7893);	// @ (0xF12 * 8 + 3)
#define                                 T5GGO_NOT_T5DONE_bit _BIT_ACCESS(T5GCON,3)
// T5GCON<T5GGO_nT5DONE>
extern volatile __bit                   T5GGO_nT5DONE       __at(0x7893);	// @ (0xF12 * 8 + 3)
#define                                 T5GGO_nT5DONE_bit   _BIT_ACCESS(T5GCON,3)
// T5GCON<T5GPOL>
extern volatile __bit                   T5GPOL              __at(0x7896);	// @ (0xF12 * 8 + 6)
#define                                 T5GPOL_bit          _BIT_ACCESS(T5GCON,6)
// T5GCON<T5GSPM>
extern volatile __bit                   T5GSPM              __at(0x7894);	// @ (0xF12 * 8 + 4)
#define                                 T5GSPM_bit          _BIT_ACCESS(T5GCON,4)
// T5GCON<T5GSS0>
extern volatile __bit                   T5GSS0              __at(0x7890);	// @ (0xF12 * 8 + 0)
#define                                 T5GSS0_bit          _BIT_ACCESS(T5GCON,0)
// T5GCON<T5GSS1>
extern volatile __bit                   T5GSS1              __at(0x7891);	// @ (0xF12 * 8 + 1)
#define                                 T5GSS1_bit          _BIT_ACCESS(T5GCON,1)
// T5GCON<T5GTM>
extern volatile __bit                   T5GTM               __at(0x7895);	// @ (0xF12 * 8 + 5)
#define                                 T5GTM_bit           _BIT_ACCESS(T5GCON,5)
// T5GCON<T5GVAL>
extern volatile __bit                   T5GVAL              __at(0x7892);	// @ (0xF12 * 8 + 2)
#define                                 T5GVAL_bit          _BIT_ACCESS(T5GCON,2)
// T6CON<T6CKPS0>
extern volatile __bit                   T6CKPS0             __at(0x79C8);	// @ (0xF39 * 8 + 0)
#define                                 T6CKPS0_bit         _BIT_ACCESS(T6CON,0)
// T6CON<T6CKPS1>
extern volatile __bit                   T6CKPS1             __at(0x79C9);	// @ (0xF39 * 8 + 1)
#define                                 T6CKPS1_bit         _BIT_ACCESS(T6CON,1)
// T6CON<T6OUTPS0>
extern volatile __bit                   T6OUTPS0            __at(0x79CB);	// @ (0xF39 * 8 + 3)
#define                                 T6OUTPS0_bit        _BIT_ACCESS(T6CON,3)
// T6CON<T6OUTPS1>
extern volatile __bit                   T6OUTPS1            __at(0x79CC);	// @ (0xF39 * 8 + 4)
#define                                 T6OUTPS1_bit        _BIT_ACCESS(T6CON,4)
// T6CON<T6OUTPS2>
extern volatile __bit                   T6OUTPS2            __at(0x79CD);	// @ (0xF39 * 8 + 5)
#define                                 T6OUTPS2_bit        _BIT_ACCESS(T6CON,5)
// T6CON<T6OUTPS3>
extern volatile __bit                   T6OUTPS3            __at(0x79CE);	// @ (0xF39 * 8 + 6)
#define                                 T6OUTPS3_bit        _BIT_ACCESS(T6CON,6)
// PORTG<T7CKI>
extern volatile __bit                   T7CKI               __at(0x7C34);	// @ (0xF86 * 8 + 4)
#define                                 T7CKI_bit           _BIT_ACCESS(PORTG,4)
// PORTD<T7G>
extern volatile __bit                   T7G                 __at(0x7C19);	// @ (0xF83 * 8 + 1)
#define                                 T7G_bit             _BIT_ACCESS(PORTD,1)
// T8CON<T8CKPS0>
extern volatile __bit                   T8CKPS0             __at(0x79B0);	// @ (0xF36 * 8 + 0)
#define                                 T8CKPS0_bit         _BIT_ACCESS(T8CON,0)
// T8CON<T8CKPS1>
extern volatile __bit                   T8CKPS1             __at(0x79B1);	// @ (0xF36 * 8 + 1)
#define                                 T8CKPS1_bit         _BIT_ACCESS(T8CON,1)
// T8CON<T8OUTPS0>
extern volatile __bit                   T8OUTPS0            __at(0x79B3);	// @ (0xF36 * 8 + 3)
#define                                 T8OUTPS0_bit        _BIT_ACCESS(T8CON,3)
// T8CON<T8OUTPS1>
extern volatile __bit                   T8OUTPS1            __at(0x79B4);	// @ (0xF36 * 8 + 4)
#define                                 T8OUTPS1_bit        _BIT_ACCESS(T8CON,4)
// T8CON<T8OUTPS2>
extern volatile __bit                   T8OUTPS2            __at(0x79B5);	// @ (0xF36 * 8 + 5)
#define                                 T8OUTPS2_bit        _BIT_ACCESS(T8CON,5)
// T8CON<T8OUTPS3>
extern volatile __bit                   T8OUTPS3            __at(0x79B6);	// @ (0xF36 * 8 + 6)
#define                                 T8OUTPS3_bit        _BIT_ACCESS(T8CON,6)
// CTMUCONH<TGEN>
extern volatile __bit                   TGEN                __at(0x7ABC);	// @ (0xF57 * 8 + 4)
#define                                 TGEN_bit            _BIT_ACCESS(CTMUCONH,4)
// INTCON<TMR0IE>
extern volatile __bit                   TMR0IE              __at(0x7F95);	// @ (0xFF2 * 8 + 5)
#define                                 TMR0IE_bit          _BIT_ACCESS(INTCON,5)
// INTCON<TMR0IF>
extern volatile __bit                   TMR0IF              __at(0x7F92);	// @ (0xFF2 * 8 + 2)
#define                                 TMR0IF_bit          _BIT_ACCESS(INTCON,2)
// INTCON2<TMR0IP>
extern volatile __bit                   TMR0IP              __at(0x7F8A);	// @ (0xFF1 * 8 + 2)
#define                                 TMR0IP_bit          _BIT_ACCESS(INTCON2,2)
// T0CON<TMR0ON>
extern volatile __bit                   TMR0ON              __at(0x7EAF);	// @ (0xFD5 * 8 + 7)
#define                                 TMR0ON_bit          _BIT_ACCESS(T0CON,7)
// T1CON<TMR1CS0>
extern volatile __bit                   TMR1CS0             __at(0x7E6E);	// @ (0xFCD * 8 + 6)
#define                                 TMR1CS0_bit         _BIT_ACCESS(T1CON,6)
// T1CON<TMR1CS1>
extern volatile __bit                   TMR1CS1             __at(0x7E6F);	// @ (0xFCD * 8 + 7)
#define                                 TMR1CS1_bit         _BIT_ACCESS(T1CON,7)
// T1GCON<TMR1GE>
extern volatile __bit                   TMR1GE              __at(0x7D57);	// @ (0xFAA * 8 + 7)
#define                                 TMR1GE_bit          _BIT_ACCESS(T1GCON,7)
// PIE1<TMR1GIE>
extern volatile __bit                   TMR1GIE             __at(0x7CEA);	// @ (0xF9D * 8 + 2)
#define                                 TMR1GIE_bit         _BIT_ACCESS(PIE1,2)
// PIR1<TMR1GIF>
extern volatile __bit                   TMR1GIF             __at(0x7CF2);	// @ (0xF9E * 8 + 2)
#define                                 TMR1GIF_bit         _BIT_ACCESS(PIR1,2)
// IPR1<TMR1GIP>
extern volatile __bit                   TMR1GIP             __at(0x7CFA);	// @ (0xF9F * 8 + 2)
#define                                 TMR1GIP_bit         _BIT_ACCESS(IPR1,2)
// PIE1<TMR1IE>
extern volatile __bit                   TMR1IE              __at(0x7CE8);	// @ (0xF9D * 8 + 0)
#define                                 TMR1IE_bit          _BIT_ACCESS(PIE1,0)
// PIR1<TMR1IF>
extern volatile __bit                   TMR1IF              __at(0x7CF0);	// @ (0xF9E * 8 + 0)
#define                                 TMR1IF_bit          _BIT_ACCESS(PIR1,0)
// IPR1<TMR1IP>
extern volatile __bit                   TMR1IP              __at(0x7CF8);	// @ (0xF9F * 8 + 0)
#define                                 TMR1IP_bit          _BIT_ACCESS(IPR1,0)
// PMD1<TMR1MD>
extern volatile __bit                   TMR1MD              __at(0x78C1);	// @ (0xF18 * 8 + 1)
#define                                 TMR1MD_bit          _BIT_ACCESS(PMD1,1)
// T1CON<TMR1ON>
extern volatile __bit                   TMR1ON              __at(0x7E68);	// @ (0xFCD * 8 + 0)
#define                                 TMR1ON_bit          _BIT_ACCESS(T1CON,0)
// PIE1<TMR2IE>
extern volatile __bit                   TMR2IE              __at(0x7CE9);	// @ (0xF9D * 8 + 1)
#define                                 TMR2IE_bit          _BIT_ACCESS(PIE1,1)
// PIR1<TMR2IF>
extern volatile __bit                   TMR2IF              __at(0x7CF1);	// @ (0xF9E * 8 + 1)
#define                                 TMR2IF_bit          _BIT_ACCESS(PIR1,1)
// IPR1<TMR2IP>
extern volatile __bit                   TMR2IP              __at(0x7CF9);	// @ (0xF9F * 8 + 1)
#define                                 TMR2IP_bit          _BIT_ACCESS(IPR1,1)
// PMD1<TMR2MD>
extern volatile __bit                   TMR2MD              __at(0x78C2);	// @ (0xF18 * 8 + 2)
#define                                 TMR2MD_bit          _BIT_ACCESS(PMD1,2)
// T2CON<TMR2ON>
extern volatile __bit                   TMR2ON              __at(0x7E52);	// @ (0xFCA * 8 + 2)
#define                                 TMR2ON_bit          _BIT_ACCESS(T2CON,2)
// T3CON<TMR3CS0>
extern volatile __bit                   TMR3CS0             __at(0x7D8E);	// @ (0xFB1 * 8 + 6)
#define                                 TMR3CS0_bit         _BIT_ACCESS(T3CON,6)
// LCDDATA19<TMR3CS019>
extern volatile __bit                   TMR3CS019           __at(0x7BCE);	// @ (0xF79 * 8 + 6)
#define                                 TMR3CS019_bit       _BIT_ACCESS(LCDDATA19,6)
// T3CON<TMR3CS1>
extern volatile __bit                   TMR3CS1             __at(0x7D8F);	// @ (0xFB1 * 8 + 7)
#define                                 TMR3CS1_bit         _BIT_ACCESS(T3CON,7)
// LCDDATA19<TMR3CS119>
extern volatile __bit                   TMR3CS119           __at(0x7BCF);	// @ (0xF79 * 8 + 7)
#define                                 TMR3CS119_bit       _BIT_ACCESS(LCDDATA19,7)
// T3GCON<TMR3GE>
extern volatile __bit                   TMR3GE              __at(0x7D87);	// @ (0xFB0 * 8 + 7)
#define                                 TMR3GE_bit          _BIT_ACCESS(T3GCON,7)
// PIE2<TMR3GIE>
extern volatile __bit                   TMR3GIE             __at(0x7D00);	// @ (0xFA0 * 8 + 0)
#define                                 TMR3GIE_bit         _BIT_ACCESS(PIE2,0)
// PIR2<TMR3GIF>
extern volatile __bit                   TMR3GIF             __at(0x7D08);	// @ (0xFA1 * 8 + 0)
#define                                 TMR3GIF_bit         _BIT_ACCESS(PIR2,0)
// IPR2<TMR3GIP>
extern volatile __bit                   TMR3GIP             __at(0x7D10);	// @ (0xFA2 * 8 + 0)
#define                                 TMR3GIP_bit         _BIT_ACCESS(IPR2,0)
// PIE2<TMR3IE>
extern volatile __bit                   TMR3IE              __at(0x7D01);	// @ (0xFA0 * 8 + 1)
#define                                 TMR3IE_bit          _BIT_ACCESS(PIE2,1)
// PIR2<TMR3IF>
extern volatile __bit                   TMR3IF              __at(0x7D09);	// @ (0xFA1 * 8 + 1)
#define                                 TMR3IF_bit          _BIT_ACCESS(PIR2,1)
// IPR2<TMR3IP>
extern volatile __bit                   TMR3IP              __at(0x7D11);	// @ (0xFA2 * 8 + 1)
#define                                 TMR3IP_bit          _BIT_ACCESS(IPR2,1)
// PMD1<TMR3MD>
extern volatile __bit                   TMR3MD              __at(0x78C3);	// @ (0xF18 * 8 + 3)
#define                                 TMR3MD_bit          _BIT_ACCESS(PMD1,3)
// T3CON<TMR3ON>
extern volatile __bit                   TMR3ON              __at(0x7D88);	// @ (0xFB1 * 8 + 0)
#define                                 TMR3ON_bit          _BIT_ACCESS(T3CON,0)
// PIE5<TMR4IE>
extern volatile __bit                   TMR4IE              __at(0x7DC8);	// @ (0xFB9 * 8 + 0)
#define                                 TMR4IE_bit          _BIT_ACCESS(PIE5,0)
// PIR5<TMR4IF>
extern volatile __bit                   TMR4IF              __at(0x7DD0);	// @ (0xFBA * 8 + 0)
#define                                 TMR4IF_bit          _BIT_ACCESS(PIR5,0)
// IPR5<TMR4IP>
extern volatile __bit                   TMR4IP              __at(0x7E90);	// @ (0xFD2 * 8 + 0)
#define                                 TMR4IP_bit          _BIT_ACCESS(IPR5,0)
// PMD1<TMR4MD>
extern volatile __bit                   TMR4MD              __at(0x78C4);	// @ (0xF18 * 8 + 4)
#define                                 TMR4MD_bit          _BIT_ACCESS(PMD1,4)
// T4CON<TMR4ON>
extern volatile __bit                   TMR4ON              __at(0x781A);	// @ (0xF03 * 8 + 2)
#define                                 TMR4ON_bit          _BIT_ACCESS(T4CON,2)
// T5CON<TMR5CS0>
extern volatile __bit                   TMR5CS0             __at(0x789E);	// @ (0xF13 * 8 + 6)
#define                                 TMR5CS0_bit         _BIT_ACCESS(T5CON,6)
// T5CON<TMR5CS1>
extern volatile __bit                   TMR5CS1             __at(0x789F);	// @ (0xF13 * 8 + 7)
#define                                 TMR5CS1_bit         _BIT_ACCESS(T5CON,7)
// T5GCON<TMR5GE>
extern volatile __bit                   TMR5GE              __at(0x7897);	// @ (0xF12 * 8 + 7)
#define                                 TMR5GE_bit          _BIT_ACCESS(T5GCON,7)
// PIE3<TMR5GIE>
extern volatile __bit                   TMR5GIE             __at(0x7D1F);	// @ (0xFA3 * 8 + 7)
#define                                 TMR5GIE_bit         _BIT_ACCESS(PIE3,7)
// PIR3<TMR5GIF>
extern volatile __bit                   TMR5GIF             __at(0x7D27);	// @ (0xFA4 * 8 + 7)
#define                                 TMR5GIF_bit         _BIT_ACCESS(PIR3,7)
// IPR3<TMR5GIP>
extern volatile __bit                   TMR5GIP             __at(0x7D2F);	// @ (0xFA5 * 8 + 7)
#define                                 TMR5GIP_bit         _BIT_ACCESS(IPR3,7)
// PIE5<TMR5IE>
extern volatile __bit                   TMR5IE              __at(0x7DC9);	// @ (0xFB9 * 8 + 1)
#define                                 TMR5IE_bit          _BIT_ACCESS(PIE5,1)
// PIR5<TMR5IF>
extern volatile __bit                   TMR5IF              __at(0x7DD1);	// @ (0xFBA * 8 + 1)
#define                                 TMR5IF_bit          _BIT_ACCESS(PIR5,1)
// IPR5<TMR5IP>
extern volatile __bit                   TMR5IP              __at(0x7E91);	// @ (0xFD2 * 8 + 1)
#define                                 TMR5IP_bit          _BIT_ACCESS(IPR5,1)
// PMD2<TMR5MD>
extern volatile __bit                   TMR5MD              __at(0x78BB);	// @ (0xF17 * 8 + 3)
#define                                 TMR5MD_bit          _BIT_ACCESS(PMD2,3)
// T5CON<TMR5ON>
extern volatile __bit                   TMR5ON              __at(0x7898);	// @ (0xF13 * 8 + 0)
#define                                 TMR5ON_bit          _BIT_ACCESS(T5CON,0)
// PIE5<TMR6IE>
extern volatile __bit                   TMR6IE              __at(0x7DCA);	// @ (0xFB9 * 8 + 2)
#define                                 TMR6IE_bit          _BIT_ACCESS(PIE5,2)
// PIR5<TMR6IF>
extern volatile __bit                   TMR6IF              __at(0x7DD2);	// @ (0xFBA * 8 + 2)
