MikroElektronika/core_packages/PIC/XC8/def/PIC18F65K90/mcu.h
#define                                 WAIT0_bit           _BIT_ACCESS(PR2,4)
// PR2<WAIT1>
extern volatile __bit                   WAIT1               __at(0x7E5D);	// @ (0xFCB * 8 + 5)
#define                                 WAIT1_bit           _BIT_ACCESS(PR2,5)
// RTCVALH<WAITB0>
extern volatile __bit                   WAITB0              __at(0x7AEE);	// @ (0xF5D * 8 + 6)
#define                                 WAITB0_bit          _BIT_ACCESS(RTCVALH,6)
// RTCVALH<WAITB1>
extern volatile __bit                   WAITB1              __at(0x7AEF);	// @ (0xF5D * 8 + 7)
#define                                 WAITB1_bit          _BIT_ACCESS(RTCVALH,7)
// RTCVALH<WAITE0>
extern volatile __bit                   WAITE0              __at(0x7AE8);	// @ (0xF5D * 8 + 0)
#define                                 WAITE0_bit          _BIT_ACCESS(RTCVALH,0)
// RTCVALH<WAITE1>
extern volatile __bit                   WAITE1              __at(0x7AE9);	// @ (0xF5D * 8 + 1)
#define                                 WAITE1_bit          _BIT_ACCESS(RTCVALH,1)
// RTCVALH<WAITM0>
extern volatile __bit                   WAITM0              __at(0x7AEA);	// @ (0xF5D * 8 + 2)
#define                                 WAITM0_bit          _BIT_ACCESS(RTCVALH,2)
// RTCVALH<WAITM1>
extern volatile __bit                   WAITM1              __at(0x7AEB);	// @ (0xF5D * 8 + 3)
#define                                 WAITM1_bit          _BIT_ACCESS(RTCVALH,3)
// RTCVALH<WAITM2>
extern volatile __bit                   WAITM2              __at(0x7AEC);	// @ (0xF5D * 8 + 4)
#define                                 WAITM2_bit          _BIT_ACCESS(RTCVALH,4)
// RTCVALH<WAITM3>
extern volatile __bit                   WAITM3              __at(0x7AED);	// @ (0xF5D * 8 + 5)
#define                                 WAITM3_bit          _BIT_ACCESS(RTCVALH,5)
// SSP1CON1<WCOL1>
extern volatile __bit                   WCOL1               __at(0x7E37);	// @ (0xFC6 * 8 + 7)
#define                                 WCOL1_bit           _BIT_ACCESS(SSP1CON1,7)
// SSP2CON1<WCOL2>
extern volatile __bit                   WCOL2               __at(0x77FF);	// @ (0xEFF * 8 + 7)
#define                                 WCOL2_bit           _BIT_ACCESS(SSP2CON1,7)
// LCDCON<WERR>
extern volatile __bit                   WERR                __at(0x77A5);	// @ (0xEF4 * 8 + 5)
#define                                 WERR_bit            _BIT_ACCESS(LCDCON,5)
// LCDPS<WFT>
extern volatile __bit                   WFT                 __at(0x77AF);	// @ (0xEF5 * 8 + 7)
#define                                 WFT_bit             _BIT_ACCESS(LCDPS,7)
// PR2<WM0>
extern volatile __bit                   WM0                 __at(0x7E58);	// @ (0xFCB * 8 + 0)
#define                                 WM0_bit             _BIT_ACCESS(PR2,0)
// PR2<WM1>
extern volatile __bit                   WM1                 __at(0x7E59);	// @ (0xFCB * 8 + 1)
#define                                 WM1_bit             _BIT_ACCESS(PR2,1)
// PORTE<WRE>
extern volatile __bit                   WRE                 __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 WRE_bit             _BIT_ACCESS(PORTE,1)
// EECON1<WREN>
extern volatile __bit                   WREN                __at(0x7BFA);	// @ (0xF7F * 8 + 2)
#define                                 WREN_bit            _BIT_ACCESS(EECON1,2)
// EECON1<WRERR>
extern volatile __bit                   WRERR               __at(0x7BFB);	// @ (0xF7F * 8 + 3)
#define                                 WRERR_bit           _BIT_ACCESS(EECON1,3)
// BAUDCON1<WUE1>
extern volatile __bit                   WUE1                __at(0x7B29);	// @ (0xF65 * 8 + 1)
#define                                 WUE1_bit            _BIT_ACCESS(BAUDCON1,1)
// BAUDCON2<WUE2>
extern volatile __bit                   WUE2                __at(0x7901);	// @ (0xF20 * 8 + 1)
#define                                 WUE2_bit            _BIT_ACCESS(BAUDCON2,1)
// STATUS<ZERO>
extern volatile __bit                   ZERO                __at(0x7EC2);	// @ (0xFD8 * 8 + 2)
#define                                 ZERO_bit            _BIT_ACCESS(STATUS,2)
// SSP2STAT<nA2>
extern volatile __bit                   nA2                 __at(0x7805);	// @ (0xF00 * 8 + 5)
#define                                 nA2_bit             _BIT_ACCESS(SSP2STAT,5)
// SSP2STAT<nADDRESS2>
extern volatile __bit                   nADDRESS2           __at(0x7805);	// @ (0xF00 * 8 + 5)
#define                                 nADDRESS2_bit       _BIT_ACCESS(SSP2STAT,5)
// RCON<nBOR>
extern volatile __bit                   nBOR                __at(0x7E80);	// @ (0xFD0 * 8 + 0)
#define                                 nBOR_bit            _BIT_ACCESS(RCON,0)
// RCON<nCM>
extern volatile __bit                   nCM                 __at(0x7E85);	// @ (0xFD0 * 8 + 5)
#define                                 nCM_bit             _BIT_ACCESS(RCON,5)
// ADCON0<nDONE>
extern volatile __bit                   nDONE               __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 nDONE_bit           _BIT_ACCESS(ADCON0,1)
// RCON<nPD>
extern volatile __bit                   nPD                 __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 nPD_bit             _BIT_ACCESS(RCON,2)
// RCON<nPOR>
extern volatile __bit                   nPOR                __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 nPOR_bit            _BIT_ACCESS(RCON,1)
// INTCON2<nRBPU>
extern volatile __bit                   nRBPU               __at(0x7F8F);	// @ (0xFF1 * 8 + 7)
#define                                 nRBPU_bit           _BIT_ACCESS(INTCON2,7)
// RCSTA1<nRC8>
extern volatile __bit                   nRC8                __at(0x7D5E);	// @ (0xFAB * 8 + 6)
#define                                 nRC8_bit            _BIT_ACCESS(RCSTA1,6)
// RCON<nRI>
extern volatile __bit                   nRI                 __at(0x7E84);	// @ (0xFD0 * 8 + 4)
#define                                 nRI_bit             _BIT_ACCESS(RCON,4)
// T1GCON<nT1DONE>
extern volatile __bit                   nT1DONE             __at(0x7D53);	// @ (0xFAA * 8 + 3)
#define                                 nT1DONE_bit         _BIT_ACCESS(T1GCON,3)
// T1CON<nT1SYNC>
extern volatile __bit                   nT1SYNC             __at(0x7E6A);	// @ (0xFCD * 8 + 2)
#define                                 nT1SYNC_bit         _BIT_ACCESS(T1CON,2)
// T3GCON<nT3DONE>
extern volatile __bit                   nT3DONE             __at(0x7D83);	// @ (0xFB0 * 8 + 3)
#define                                 nT3DONE_bit         _BIT_ACCESS(T3GCON,3)
// T3CON<nT3SYNC>
extern volatile __bit                   nT3SYNC             __at(0x7D8A);	// @ (0xFB1 * 8 + 2)
#define                                 nT3SYNC_bit         _BIT_ACCESS(T3CON,2)
// T5GCON<nT5DONE>
extern volatile __bit                   nT5DONE             __at(0x7893);	// @ (0xF12 * 8 + 3)
#define                                 nT5DONE_bit         _BIT_ACCESS(T5GCON,3)
// T5CON<nT5SYNC>
extern volatile __bit                   nT5SYNC             __at(0x789A);	// @ (0xF13 * 8 + 2)
#define                                 nT5SYNC_bit         _BIT_ACCESS(T5CON,2)
// RCON<nTO>
extern volatile __bit                   nTO                 __at(0x7E83);	// @ (0xFD0 * 8 + 3)
#define                                 nTO_bit             _BIT_ACCESS(RCON,3)
// TXSTA1<nTX8>
extern volatile __bit                   nTX8                __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 nTX8_bit            _BIT_ACCESS(TXSTA1,6)
// SSP2STAT<nW2>
extern volatile __bit                   nW2                 __at(0x7802);	// @ (0xF00 * 8 + 2)
#define                                 nW2_bit             _BIT_ACCESS(SSP2STAT,2)
// SSP2STAT<nWRITE2>
extern volatile __bit                   nWRITE2             __at(0x7802);	// @ (0xF00 * 8 + 2)
#define                                 nWRITE2_bit         _BIT_ACCESS(SSP2STAT,2)

#endif // _PIC18F65K90_H_
